{"version": "https://jsonfeed.org/version/1.1", "title": "Safer Streets @ Leeds", "home_page_url": "http://safer-streets.github.io/", "feed_url": "http://safer-streets.github.io/feed_json_created.json", "description": "Progress updates from the Safer Streets project at the University of Leeds", "icon": null, "authors": [{"name": "Andrew P Smith"}], "language": "en", "items": [{"id": "http://safer-streets.github.io/blog/2025/11/18/scaling-up/", "url": "http://safer-streets.github.io/blog/2025/11/18/scaling-up/", "title": "Scaling Up", "content_html": "<h1>Scaling Up</h1>\n<p>As we're progressing with nationwide and force-specific hotspot determination we have had to reassess some of the\ntooling we've been using so far, particularly for presenting and disseminating results, and with a view to producing\npractical tools for practitioners and policymakers.</p>\n<p>We've started to hit performance limitations with geopandas so are switching a lot of the CPU-intensive spatial code to\nuse an ephemeral <a href=\"https://duckdb.org/\">duckdb</a> instance with the\n<a href=\"https://duckdb.org/docs/stable/core_extensions/spatial/overview\">spatial extension</a>. This is exceptionally fast, able\nto load 3 years of national crime data (~18m incidents, England &amp; Wales) from over 1500 individual parquet files, and\ngroup the crimes into 200m hex cells (~1.5m) - all in well under 10 seconds.</p>\n<p>We've previously used Streamlit as a front-end (see\n<a href=\"https://uol-a011-prd-uks-wkld025-asp1-app1.azurewebsites.net\">here</a>) but it's also not scaling well, proving somewhat\ninflexible and has compatibility issues with duckdb, so we're looking at alternatives. Later in the project we'll post\na more definitive article on recommendations for the best (python) tooling, but in the meantime we're excited about\nthe possibilities duckdb enables and want to share some progress...</p>", "image": null, "date_modified": "2025-11-26T15:53:51.997388+00:00", "date_published": "2025-11-18T00:00:00+00:00", "authors": [{"name": "Andrew Smith"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/10/13/measuring-crime-concentration-part-2/", "url": "http://safer-streets.github.io/blog/2025/10/13/measuring-crime-concentration-part-2/", "title": "Measuring Crime Concentration (Part 2)", "content_html": "<h1>Measuring Crime Concentration (Part 2)</h1>\n<p>We demonstrated in <a href=\"measuring-concentration.md\">part 1</a> that random data with no structural concentration will exhibit\nsome concentration using the traditional measures. In this article we taker a deeper dive into this claim.</p>\n<p>Recall that our <em>null hypothesis</em> was that crimes are not concentrated, crime is is no more or less likely to occur\nin any given spatial unit, and the chance of a crime occurrence is not affected by previous events.</p>\n<h2>Motivating example - Seasonality</h2>\n<p>Public crime data in the UK contains precise (but obfuscated) location data, imprecise temporal information (the month\nof occurrence) and broad categorical information (around a dozen categories). Taking 3 years of data for incidents of\nASB in West Yorkshire, aggregating crime into spatial units (in this case LSOA) we can plot a graph of (naive) Gini over time.</p>\n<p><em>[ASB]: antisocial behaviour\n</em>[LSOA]: a statistical (census) geography containing roughly 2000 residents</p>\n<p>This graph shows some clear seasonality - concentration increases in the winter and decreases in the summer. A fairly\nobvious explanation for this would be that since antisocial behaviour generally occurs outdoors, there are simply more\noutdoor gatherings in warmer weather and longer daylight hours, therefore more opportunities.</p>\n<p><img alt=\"Gini seasonality\" src=\"../../img/gini-seasonality.png\"></p>\n<p>However, more careful analysis of the data shows the apparent seasonality <strong>is an illusion</strong>. Here's why...</p>", "image": null, "date_modified": "2025-11-26T15:53:51.977963+00:00", "date_published": "2025-10-13T00:00:00+00:00", "authors": [{"name": "Andrew Smith"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/09/15/demographics/", "url": "http://safer-streets.github.io/blog/2025/09/15/demographics/", "title": "Demographics", "content_html": "<h1>Demographics</h1>\n<p>When we look at crime counts at different spatial scales, it is often useful to try to understand the demographics of\nthe area. Older people are more likely to be victims of certain crimes, for instance, and for others there are often\ncorrelations between crime incidence and the deprivation, socioeconomic status or other makeup of the area.</p>\n<p>The UK census is the biggest source of demographic data, providing many attributes over various spatial scales. With\ncensus data there is always a tradeoff between spatial and categorical resolutions, often to preserve anonymity. For\nexample, the highest spatial resolution for counts of people by age in years is MSOA, and at higher resolutions\n(LSOA, OA) age is only given in 5-year bands.</p>\n<p><em>[MSOA]: Middle-layer Super Output Area\n</em>[LSOA]: Lower-layer Super Output Area\n*[OA]: Output Area</p>\n<p>Another very important consideration is that we will want to aggregate people to non-statistical geographies, such as\ngrids and hexes. In order to do this, we could simply place people at random points within the statistical geography,\nthen take those that fall within the new geography. However this can be unrealistic, particularly in areas that are\nrural or contain large-scale non-residential infrastructure or bodies of water (despite Monty Python's boasts, nobody\nin Yorkshire lives under a lake!).</p>", "image": null, "date_modified": "2025-11-26T15:53:51.966384+00:00", "date_published": "2025-09-15T00:00:00+00:00", "authors": [{"name": "Andrew Smith"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/08/27/crime-prevention-features/", "url": "http://safer-streets.github.io/blog/2025/08/27/crime-prevention-features/", "title": "Crime prevention features", "content_html": "<h2>Understanding the Dimensions of Crime Prevention Interventions</h2>\n<p>Crime prevention interventions can be characterised in many different ways. The College of Policing’s <a href=\"https://www.college.police.uk/research/crime-reduction-toolkit\">Crime Reduction Toolkit</a> and its underpinning <a href=\"https://link.springer.com/article/10.1007/s11292-015-9238-7\">EMMIE framework</a> provide a robust approach for assessing <em>what works</em> to reduce crime. But applying that knowledge in practice requires us to think carefully about how specific interventions will interact with the <em>spatial and temporal characteristics</em> of the problems they are intended to address. Understanding not just <em>whether</em> something works, but <em>where</em>, <em>when</em>, and <em>under what conditions</em>, is crucial for matching interventions to the dynamics of crime on the ground.</p>", "image": null, "date_modified": "2025-11-26T15:53:51.962408+00:00", "date_published": "2025-08-27T00:00:00+00:00", "authors": [{"name": "Dan Birks"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/08/22/measuring-crime-concentration-part-1/", "url": "http://safer-streets.github.io/blog/2025/08/22/measuring-crime-concentration-part-1/", "title": "Measuring Crime Concentration (Part 1)", "content_html": "<h1>Measuring Crime Concentration (Part 1)</h1>\n<p>What constitutes concentration? In these articles we ask:</p>\n<ul>\n<li>how do we count crimes? And how do we account for and control for heterogeneity in our observations (units with different area\nand populations)?</li>\n<li>how do we decide if crime is concentrated? What measures are traditionally used?</li>\n<li>if crime is purely random and thus <em>isn't</em> concentrated in any meaningful sense, will we still measure\nsome concentration using traditional measures?</li>\n<li>can we develop a \"null hypothesis\" statistical model to create a baseline measure, allowing us to differentiate\nbetween random and structural effects? What features must this model have to be realistic?</li>\n<li>how do we develop this into a useful measure?</li>\n</ul>", "image": null, "date_modified": "2025-09-22T00:00:00+00:00", "date_published": "2025-08-22T00:00:00+00:00", "authors": [{"name": "Andrew Smith"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/08/18/why-is-all-this-maths/", "url": "http://safer-streets.github.io/blog/2025/08/18/why-is-all-this-maths/", "title": "Why is all this maths important?", "content_html": "<h1>Why is all this maths important?</h1>\n<h3>An introduction to the rationale behind our analytical approach</h3>\n<p><em>This post is the first in a short blog series designed to accompany the analyses, documentation and reproducible code developed as part of our Safer Streets project. While the technical outputs are aimed at transparency and reusability, this series provides a more accessible commentary on the </em>why<em> behind the </em>what<em> - why we’re doing what we’re doing, and why it matters for policing and crime prevention practice.</em></p>\n<hr>", "image": null, "date_modified": "2025-11-26T15:53:52.001481+00:00", "date_published": "2025-08-18T00:00:00+00:00", "authors": [{"name": "Dan Birks"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/08/11/crime-concentration-explorer/", "url": "http://safer-streets.github.io/blog/2025/08/11/crime-concentration-explorer/", "title": "Crime Concentration Explorer", "content_html": "<h1>Crime Concentration Explorer</h1>\n<p>!!! warning \"Update\"</p>\n<pre><code>**Since its original publication, the demo app mentioned in this article has been replaced with an\n[evolving multipage app](https://uol-a011-prd-uks-wkld025-asp1-app1.azurewebsites.net/) with greater coverage and\nfunctionality. Links in this page have been updated to point to the newer implementation.**\n</code></pre>\n<p><img alt=\"screenshot\" src=\"../../img/crime-concentration-explorer.png\"></p>\n<h2>Rationale</h2>\n<p>This app has been built as a proof-of-concept tool for practitioners and policymakers with an interest in the patterns\nof crime concentration, using only publicly available data. It enables users to visualise crime hotspots over time\nfor a given Police Force Area (PFA).</p>", "image": null, "date_modified": "2025-11-24T00:00:00+00:00", "date_published": "2025-08-11T00:00:00+00:00", "authors": [{"name": "Andrew Smith"}], "tags": null}, {"id": "http://safer-streets.github.io/blog/2025/07/30/introducing-safer-streets/", "url": "http://safer-streets.github.io/blog/2025/07/30/introducing-safer-streets/", "title": "Introducing Safer Streets", "content_html": "<h1>Introducing Safer Streets</h1>\n<p>Welcome! :wave:</p>\n<p>Here you will find:</p>\n<ul>\n<li><a href=\"../../blog/index.md\">blog articles</a></li>\n<li>links to <a href=\"../../index.md#apps\">interactive tools</a>...</li>\n</ul>", "image": null, "date_modified": "2025-07-30T00:00:00+00:00", "date_published": "2025-07-30T00:00:00+00:00", "authors": [{"name": "Safer Streets Team"}], "tags": null}]}